app/controllers/admin/users_controller.rb

    def show
      authorize @user
      @lead_courses = LeadQual.where(user_id: @user.id)
---
SELECT "lead_quals".* FROM "lead_quals" WHERE "lead_quals"."user_id" = $1  [["user_id", 1]]

    def create
      @user = User.new(user_params)
      authorize @user

      if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "confirmation_token", "confirmation_sent_at", "role", "first_name", "last_name", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def update
      authorize @user
      # Allow updating the user without changing its password (password field
      # will be blank). Remove the password key of the params hash if it's blank
      # (avoid validation error).
      if params[:user][:password].blank?
        params[:user].delete(:password)
        params[:user].delete(:password_confirmation)
      end

      if @user.update(user_params)
---
UPDATE "users" SET "email" = $1, "first_name" = $2, "last_name" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["email", "user94@test.com"], ["first_name", "Zachariah"], ["last_name", "Corwin"], ["updated_at", "2018-12-07 19:02:31.565234"], ["id", 1]]

    def destroy
      authorize @user

      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]

    def set_user
      @user = User.friendly.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]