app/views/deliveries/_form.html.erb

      <div class="form-group">
        <%= f.select :course_id, options_for_select(Course.all.collect {
          | course | ["#{course.course_number} - #{(course.title)}", course.id]
          }, @delivery.course_id), {prompt: "CHOOSE COURSE"}, {} %>
---
SELECT "courses".* FROM "courses"

        <%= f.label :lead_instructor, "Lead Instructor",id: :delivery_lead_instructor %><br>
        <%= f.select :lead_instructor, options_for_select(User.instructors.all.collect { | instructor | [instructor.full_name, instructor.id] }, @delivery.lead_instructor), {prompt: "CHOOSE INSRTUCTOR"}, {} %>
---
SELECT "users".* FROM "users" WHERE "users"."instructor" = $1  [["instructor", "t"]]