app/views/deliveries/show.html.erb

SELECT "unit_instructors".* FROM "unit_instructors" WHERE "unit_instructors"."delivery_id" = $1  [["delivery_id", 2]]
---
          <ul>
            <% @delivery.unit_instructors.each do |i| %>