app/controllers/deliveries_controller.rb

SELECT "deliveries".* FROM "deliveries" ORDER BY start_date ASC
---
  def index
    @deliveries = Delivery.all.order('start_date ASC')

INSERT INTO "deliveries" ("course_number", "course_id", "fees", "start_date", "end_date", "times", "address", "requestor", "poc", "notes", "city", "state", "zip", "booked", "created_at", "updated_at", "lead_instructor") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    @delivery = Delivery.new(delivery_params)

    respond_to do |format|
      if @delivery.save

UPDATE "deliveries" SET "course_id" = $1, "credits" = $2, "fees" = $3, "seat_load" = $4, "updated_at" = $5 WHERE "deliveries"."id" = $6  [["course_id", 1], ["credits", 0], ["fees", 0], ["seat_load", 25], ["updated_at", "2018-12-10 19:58:33.238230"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @delivery.update(delivery_params)

DELETE FROM "deliveries" WHERE "deliveries"."id" = $1  [["id", 1]]
---
  def destroy
    @delivery.destroy

SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_delivery
      @delivery = Delivery.find(params[:id])