app/controllers/unit_instructors_controller.rb

  def index
    @unit_instructors = UnitInstructor.all
---
SELECT "unit_instructors".* FROM "unit_instructors"

  def create
    @unit_instructor = UnitInstructor.new(unit_instructor_params)

    respond_to do |format|
      if @unit_instructor.save
---
INSERT INTO "unit_instructors" ("delivery_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["delivery_id", 2], ["user_id", 6], ["created_at", "2018-12-20 21:57:29.010514"], ["updated_at", "2018-12-20 21:57:29.010514"]]

  def destroy
    @unit_instructor.destroy
---
DELETE FROM "unit_instructors" WHERE "unit_instructors"."id" = $1  [["id", 10]]

    def set_unit_instructor
      @unit_instructor = UnitInstructor.find(params[:id])
---
SELECT  "unit_instructors".* FROM "unit_instructors" WHERE "unit_instructors"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]