app/views/admin/users/index.html.erb

SELECT COUNT(*) FROM "users"
---
            <%= f.label t(".role") %><br>
            <%= f.select :role_eq, User.roles,
                         {include_blank: t("filters.any")},
                         {class: "form-control"} %>