app/views/admin/users/show.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "lead_quals" ON "courses"."id" = "lead_quals"."course_id" WHERE "lead_quals"."user_id" = $1  [["user_id", 1]]
---
       <% @lead_courses.each do |c| %>
        <li class="course-button"><%= c.find_course.course_number %></li>